Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of wisdom, the purity of feelings conditioned by visually compounded sensory contact, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། རྣ་བའི་འདུས་ཏེ་རེག་བའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: Feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are pure owing to the purity of the perfection of wisdom. [

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All phenomena, attributes, and attainments], up to and including all-aspect omniscience, are pure owing to the purity of feelings conditioned by mentally compounded sensory contact [and so forth].

source: དེ་ལྟར་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: So it is that the purity of the perfection of wisdom, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity.

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། ཚོར་བ་དང་འདུ་ཤེས་དང་། འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: Feelings, perceptions, formative predispositions, and consciousness are pure owing to the purity of the perfection of generosity [and so forth].

source: རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of consciousness [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of consciousness [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་རྣམ་པར་དག་པ།
en: The eyes are pure owing to the purity of the perfection of generosity [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of the eyes, and this purity of [all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་། ཡིད་རྣམ་པར་དག་པ།
en: The ears, nose, tongue, body, and mental faculty are pure owing to the purity of the perfection of generosity [and so forth].

source: ཡིད་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of the mental faculty [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of the mental faculty [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Sights are pure owing to the purity of the perfection of generosity [and so forth].

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་རྣམ་པར་དག་པ།
en: Sounds, odors, tastes, tangibles, and mental phenomena are pure owing to the purity of the perfection of generosity [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཆོས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of mental phenomena [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ།
en: Visual consciousness is pure owing to the purity of the perfection of generosity [and so forth].

source: མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of visual consciousness.

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of visual consciousness, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of mental consciousness [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of mental consciousness [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ།
en: Visually compounded sensory contact is pure owing to the purity of the perfection of generosity [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of visually compounded sensory contact, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: རྣ་བའི་འདུས་ཏེ་རེག་པ་དང་། སྣའི་འདུས་ཏེ་རེག་པ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ།
en: Aurally compounded sensory contact, nasally compounded sensory contact, lingually compounded sensory contact, corporeally compounded sensory contact, and mentally compounded sensory contact are pure owing to the purity of the perfection of generosity [and so forth].

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of mentally compounded sensory contact [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ།
en: Feelings conditioned by visually compounded sensory contact are pure owing to the purity of the perfection of generosity [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of feelings conditioned by visually compounded sensory contact, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པས། རྣ་བའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། སྣའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལྕེའི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་། ལུས་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་དང་།
en: Feelings conditioned by aurally compounded sensory contact, feelings conditioned by nasally compounded sensory contact, feelings conditioned by lingually compounded sensory contact, feelings conditioned by corporeally compounded sensory contact, and feelings conditioned by mentally compounded sensory contact are pure owing to the purity of the perfection of generosity [and so forth].

source: དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the perfection of generosity [and so forth], the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of the emptiness of internal phenomena.

source: གཟུགས་རྣམ་པ་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the emptiness of internal phenomena, the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of the emptiness of internal phenomena.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of feelings conditioned by mentally compounded sensory contact [and so forth].

source: དེ་ལྟར་ན་ནང་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the emptiness of internal phenomena, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དེ་ལྟར་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the emptiness of the essential nature of nonentities [and so forth], the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དེ་ལྟར་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the emptiness of the essential nature of nonentities [and so forth], the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of the applications of mindfulness.

source: དེ་ལྟར་ན་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the applications of mindfulness, the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of the applications of mindfulness.

source: ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱི་ས་ཚོར་བ་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of feelings conditioned by mentally compounded sensory contact [and so forth].

source: དེ་ལྟར་ན་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the applications of mindfulness, the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of [the other causal attributes], up to and including the noble eightfold path.

source: དེ་ལྟར་ན་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the noble eightfold path [and so forth], the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: །འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པའི་བར་དུ་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of [the other causal attributes], up to and including the noble eightfold path.

source: དེ་ལྟར་ན་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: So it is that the purity of the noble eightfold path [and so forth], the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམ་པར་དག་པས།
en: Physical forms are pure owing to the purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: གཟུགས་རྣམ་པར་དག་པ། གཟུགས་རྣམ་པར་དག་པས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་སྟེ།
en: All-aspect omniscience [and so forth] are pure owing to the purity of physical forms.

source: དེ་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་ས་སོ་མ་ཡིན་ཐ་མི་དད་དོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་།
en: So it is that the purity of the distinct qualities of the buddhas [and so forth], the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. [

source: སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པས།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.

source: དེ་ལྟར་ན་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམ་པར་དག་པ་དང་། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་སོ་སོ་མ་ཡིན་ཐ་མི་དད་དོ།
en: So it is that the purity of the distinct qualities of the buddhas [and so forth], the purity of feelings conditioned by mentally compounded sensory contact [and so forth], and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “

source: །རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་རྣམ་པར་དག་པས། གཟུགས་རྣམ་པར་དག་པ།
en: Physical forms are pure owing to the purity of the fruit of entering the stream to nirvāṇa.

source: དེ་ལྟར་ན་རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་རྣམ་པར་དག་པ་དང་། གཟུགས་རྣམ་པར་དག་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྣམ་པར་དག་པ་འདི་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་ས་སོ་མ་ཡིན་ཐ་མི་དད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། །བམ་པོ་སུམ་ཅུ་དགུ་པ།
en: So it is that the purity of the fruit of entering the stream to nirvāṇa, the purity of physical forms, and this purity [of all phenomena, attributes, and attainments], up to and including all-aspect omniscience, are not two things, they cannot be divided into two, and they cannot be differentiated or distinguished. “[

source: རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་རྣམ་པར་དག་པས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བའི་བར་དུ་རྣམ་པར་དག་པ།
en: All phenomena], up to and including feelings conditioned by mentally compounded sensory contact, are pure owing to the purity of the fruit of entering the stream to nirvāṇa.
